In [2]:
import pandas as pd

In [3]:
Airports = pd.Series(['Seattle-Tacoma', 'Dulles', 'London-Heathrow', 'Schiphol'])

In [4]:
Airports

0     Seattle-Tacoma
1             Dulles
2    London-Heathrow
3           Schiphol
dtype: object

In [5]:
Airports_City = pd.DataFrame([['Seattle-Tacoma', 'Seattle', 'USA', 'Schiphol'],
                            ['Dulles', 'Washington', 'USA'],
                            ['London-Heathrow', 'London', 'United Kingdom'],
                            ['Schiphol', 'Amsterdam', 'Netherlands']])

# DataFrame Notes

1. Notice that pd.DataFrame is a List of lists.

In [6]:
Airports_City

                 0           1               2         3
0   Seattle-Tacoma     Seattle             USA  Schiphol
1           Dulles  Washington             USA      None
2  London-Heathrow      London  United Kingdom      None
3         Schiphol   Amsterdam     Netherlands      None

In [7]:
Airports_City = pd.DataFrame([['Seattle-Tacoma', 'Seattle', 'USA'],
                            ['Dulles', 'Washington', 'USA'],
                            ['London-Heathrow', 'London', 'United Kingdom'],
                            ['Schiphol', 'Amsterdam', 'Netherlands']], columns = ['Name', 'City', 'Country'])

In [8]:
Airports_City

              Name        City         Country
0   Seattle-Tacoma     Seattle             USA
1           Dulles  Washington             USA
2  London-Heathrow      London  United Kingdom
3         Schiphol   Amsterdam     Netherlands

# head(). tail(), info(), shape

In [9]:
Airports_City.head(2)

             Name        City Country
0  Seattle-Tacoma     Seattle     USA
1          Dulles  Washington     USA

In [10]:
Airports_City.tail(2)

              Name       City         Country
2  London-Heathrow     London  United Kingdom
3         Schiphol  Amsterdam     Netherlands

In [11]:
Airports_City.shape

(4, 3)

In [12]:
Airports_City.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     4 non-null      object
 1   City     4 non-null      object
 2   Country  4 non-null      object
dtypes: object(3)
memory usage: 224.0+ bytes

# Query Data frame - iloc ,

In [13]:
Airports_City[['Name', 'City', 'Country']]

              Name        City         Country
0   Seattle-Tacoma     Seattle             USA
1           Dulles  Washington             USA
2  London-Heathrow      London  United Kingdom
3         Schiphol   Amsterdam     Netherlands

In [14]:
Airports_City.iloc[1,2]

'USA'

# also specify a range in the iloc

In [15]:
Airports_City.iloc[:,:]

              Name        City         Country
0   Seattle-Tacoma     Seattle             USA
1           Dulles  Washington             USA
2  London-Heathrow      London  United Kingdom
3         Schiphol   Amsterdam     Netherlands

In [16]:
Airports_City.iloc[:,0:2]

              Name        City
0   Seattle-Tacoma     Seattle
1           Dulles  Washington
2  London-Heathrow      London
3         Schiphol   Amsterdam

In [17]:
airports_data = pd.read_csv('data/airports.csv', on_bad_lines='warn')

b'Skipping line 5: expected 3 fields, saw 4\n'

In [18]:
airports_data

             Name        City         Country
0  Seattle-Tacoma     Seattle             USA
1          Dulles  Washington             USA
2        Heathrow      London  United Kingdom
3          Changi   Singapore       Singapore
4         Pearson     Toronto          Canada
5          Narita       Tokyo           Japan

# Remove column from a data frame either inplace or in another dataframe

In [19]:
flight_delays_df = pd.read_csv('data/flight_delays.csv', on_bad_lines='warn')

In [20]:
flight_delays_df

,FL_DATE,OP_UNIQUE_CARRIER,TAIL_NUM,OP_CARRIER_FL_NUM,ORIGIN,DEST,CRS_DEP_TIME,DEP_TIME,DEP_DELAY,CRS_ARR_TIME,ARR_TIME,ARR_DELAY,CRS_ELAPSED_TIME,ACTUAL_ELAPSED_TIME,AIR_TIME,DISTANCE
0,2018-10-01,WN,N221WN,802,ABQ,BWI,905,903,-2,1450,1433,-17,225,210,197,1670
1,2018-10-01,WN,N8329B,3744,ABQ,BWI,1500,1458,-2,2045,2020,-25,225,202,191,1670
2,2018-10-01,WN,N920WN,1019,ABQ,DAL,1800,1802,2,2045,2032,-13,105,90,80,580
3,2018-10-01,WN,N480WN,1499,ABQ,DAL,950,947,-3,1235,1223,-12,105,96,81,580
4,2018-10-01,WN,N227WN,3635,ABQ,DAL,1150,1151,1,1430,1423,-7,100,92,80,580
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
94,2018-10-01,WN,N230WN,1176,ATL,HOU,1955,1955,0,2105,2057,-8,130,122,101,696
95,2018-10-01,WN,N786SW,1433,ATL,HOU,1130,1308,98,1235,1443,128,125,155,140,696
96,2018-10-01,WN,N452WN,2847,ATL,HOU,605,601,-4,710,659,-11,125,118,99,696
97,2018-10-01,WN,N8619F,5161,ATL,HOU,1340,1333,-7,1440,1503,23,120,150,136,696
98,2018-10-01,WN,N8513F,812,ATL,IAD,1535,1535,0,1725,1727,2,110,112,78,534

In [21]:
flight_delays_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 99 entries, 0 to 98
Data columns (total 16 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   FL_DATE              99 non-null     object
 1   OP_UNIQUE_CARRIER    99 non-null     object
 2   TAIL_NUM             99 non-null     object
 3   OP_CARRIER_FL_NUM    99 non-null     int64
 4   ORIGIN               99 non-null     object
 5   DEST                 99 non-null     object
 6   CRS_DEP_TIME         99 non-null     int64
 7   DEP_TIME             99 non-null     int64
 8   DEP_DELAY            99 non-null     int64
 9   CRS_ARR_TIME         99 non-null     int64
 10  ARR_TIME             99 non-null     int64
 11  ARR_DELAY            99 non-null     int64
 12  CRS_ELAPSED_TIME     99 non-null     int64
 13  ACTUAL_ELAPSED_TIME  99 non-null     int64
 14  AIR_TIME             99 non-null     int64
 15  DISTANCE             99 non-null     int64
dtypes: int64(11), object(5)
memory usage: 12.5+ KB

# Creating a new dataframe by fetching values from existing data frame by using loc and speicying which columns

In [22]:
flight_delays_qunatitative_df = flight_delays_df.loc[:,['FL_DATE','OP_UNIQUE_CARRIER','TAIL_NUM','OP_CARRIER_FL_NUM','ORIGIN','DEST']]

In [23]:
flight_delays_qunatitative_df

       FL_DATE OP_UNIQUE_CARRIER TAIL_NUM  OP_CARRIER_FL_NUM ORIGIN DEST
0   2018-10-01                WN   N221WN                802    ABQ  BWI
1   2018-10-01                WN   N8329B               3744    ABQ  BWI
2   2018-10-01                WN   N920WN               1019    ABQ  DAL
3   2018-10-01                WN   N480WN               1499    ABQ  DAL
4   2018-10-01                WN   N227WN               3635    ABQ  DAL
..         ...               ...      ...                ...    ...  ...
94  2018-10-01                WN   N230WN               1176    ATL  HOU
95  2018-10-01                WN   N786SW               1433    ATL  HOU
96  2018-10-01                WN   N452WN               2847    ATL  HOU
97  2018-10-01                WN   N8619F               5161    ATL  HOU
98  2018-10-01                WN   N8513F                812    ATL  IAD

[99 rows x 6 columns]

In [24]:
    flight_delays_qunatitative_df.drop(columns = ['FL_DATE'], inplace=True)

In [25]:
flight_delays_qunatitative_df

   OP_UNIQUE_CARRIER TAIL_NUM  OP_CARRIER_FL_NUM ORIGIN DEST
0                 WN   N221WN                802    ABQ  BWI
1                 WN   N8329B               3744    ABQ  BWI
2                 WN   N920WN               1019    ABQ  DAL
3                 WN   N480WN               1499    ABQ  DAL
4                 WN   N227WN               3635    ABQ  DAL
..               ...      ...                ...    ...  ...
94                WN   N230WN               1176    ATL  HOU
95                WN   N786SW               1433    ATL  HOU
96                WN   N452WN               2847    ATL  HOU
97                WN   N8619F               5161    ATL  HOU
98                WN   N8513F                812    ATL  IAD

[99 rows x 5 columns]

# Handling duplicate rows with missing values

In [26]:
Lots_of_flight_data_dframe = pd.read_csv('data/Lots_of_flight_data.csv', on_bad_lines='warn')

In [27]:
Lots_of_flight_data_dframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300000 entries, 0 to 299999
Data columns (total 16 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   FL_DATE              300000 non-null  object
 1   OP_UNIQUE_CARRIER    300000 non-null  object
 2   TAIL_NUM             299660 non-null  object
 3   OP_CARRIER_FL_NUM    300000 non-null  int64
 4   ORIGIN               300000 non-null  object
 5   DEST                 300000 non-null  object
 6   CRS_DEP_TIME         300000 non-null  int64
 7   DEP_TIME             296825 non-null  float64
 8   DEP_DELAY            296825 non-null  float64
 9   CRS_ARR_TIME         300000 non-null  int64
 10  ARR_TIME             296574 non-null  float64
 11  ARR_DELAY            295832 non-null  float64
 12  CRS_ELAPSED_TIME     300000 non-null  int64
 13  ACTUAL_ELAPSED_TIME  295832 non-null  float64
 14  AIR_TIME             295832 non-null  float64
 15  DISTANCE             300000 non-null  int64
dtypes: float64(6), int64(5), object(5)
memory usage: 36.6+ MB

# Handle missing values

In [28]:
Lots_of_flight_data_missingval_removed_df = Lots_of_flight_data_dframe.dropna()

In [29]:
Lots_of_flight_data_missingval_removed_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 295832 entries, 0 to 299999
Data columns (total 16 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   FL_DATE              295832 non-null  object
 1   OP_UNIQUE_CARRIER    295832 non-null  object
 2   TAIL_NUM             295832 non-null  object
 3   OP_CARRIER_FL_NUM    295832 non-null  int64
 4   ORIGIN               295832 non-null  object
 5   DEST                 295832 non-null  object
 6   CRS_DEP_TIME         295832 non-null  int64
 7   DEP_TIME             295832 non-null  float64
 8   DEP_DELAY            295832 non-null  float64
 9   CRS_ARR_TIME         295832 non-null  int64
 10  ARR_TIME             295832 non-null  float64
 11  ARR_DELAY            295832 non-null  float64
 12  CRS_ELAPSED_TIME     295832 non-null  int64
 13  ACTUAL_ELAPSED_TIME  295832 non-null  float64
 14  AIR_TIME             295832 non-null  float64
 15  DISTANCE             295832 non-null  int64
dtypes: float64(6), int64(5), object(5)
memory usage: 38.4+ MB

# remove duplicate rows

In [30]:
Lots_of_flight_data_missingval_removed_df.duplicated()

0         False
1         False
2         False
3         False
4         False
          ...
299995    False
299996    False
299997    False
299998    False
299999    False
Length: 295832, dtype: bool

In [32]:
Lots_of_flight_data_missingval_removed_df[
    Lots_of_flight_data_missingval_removed_df.duplicated()
]

Empty DataFrame
Columns: [FL_DATE, OP_UNIQUE_CARRIER, TAIL_NUM, OP_CARRIER_FL_NUM, ORIGIN, DEST, CRS_DEP_TIME, DEP_TIME, DEP_DELAY, CRS_ARR_TIME, ARR_TIME, ARR_DELAY, CRS_ELAPSED_TIME, ACTUAL_ELAPSED_TIME, AIR_TIME, DISTANCE]
Index: []